# Exercise 02 -  OLAP Cubes - Roll Up and Drill Down

All the databases table in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

Start by connecting to the database by running the cells below. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed the slicing and dicing exercise, then skip to the second cell.

### Connect to the local databae where pagila is loaded

In [1]:
import sql
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'Met/14/7472'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

postgresql://postgres:Met/14/7472@127.0.0.1:5432/pagila

## Roll-up
- Stepping up the level of aggregation to a large grouping
- e.g.`city` is summed as `country`

TODO: Write a query that calculates revenue (sales_amount) by day, rating, and country. Sort the data by revenue in descending order, and limit the data to the top 20 results. The first few rows of your output should match the table below.

In [2]:
%%time
%%sql

SELECT d.day, m.rating, c.country, sum(sales_amount) as revenue
FROM factsales f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimcustomer c ON (f.customer_key = c.customer_key)
GROUP BY (d.day, m.rating, c.country)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 6.66 ms, sys: 0 ns, total: 6.66 ms
Wall time: 651 ms

[(30, 'PG-13', 'China', 4321.86),
 (30, 'PG-13', 'India', 3720.60000000001),
 (30, 'R', 'China', 3574.55000000001),
 (30, 'PG', 'China', 3567.38000000001),
 (30, 'R', 'India', 3394.25000000001),
 (30, 'NC-17', 'India', 3375.17000000001),
 (30, 'NC-17', 'China', 3348.88000000001),
 (30, 'PG', 'India', 3254.81000000001),
 (30, 'G', 'India', 2854.40000000001),
 (18, 'PG-13', 'India', 2812.09),
 (18, 'NC-17', 'India', 2731.53),
 (30, 'G', 'China', 2657.37),
 (18, 'R', 'India', 2654.39),
 (18, 'PG', 'India', 2561.77),
 (21, 'PG-13', 'India', 2537.45),
 (20, 'PG-13', 'India', 2423.43),
 (17, 'PG-13', 'China', 2390.35),
 (18, 'G', 'India', 2364.14),
 (19, 'PG-13', 'China', 2322.13),
 (21, 'PG', 'India', 2220.18)]

## Drill-down
- Breaking up one of the dimensions to a lower level.
- e.g.`city` is broken up into  `districts`

TODO: Write a query that calculates revenue (sales_amount) by day, rating, and district. Sort the data by revenue in descending order, and limit the data to the top 20 results. The first few rows of your output should match the table below.

In [3]:
%%time
%%sql
SELECT d.day, m.rating, c.district, sum(sales_amount) as revenue
FROM factsales f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimcustomer c ON (f.customer_key = c.customer_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
group by (d.day, m.rating, c.district)
order by revenue desc
limit 20;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 6.07 ms, sys: 0 ns, total: 6.07 ms
Wall time: 1.15 s

[(30, 'PG-13', 'Southern Tagalog', 822.060000000001),
 (30, 'PG', 'Southern Tagalog', 694.520000000001),
 (30, 'NC-17', 'Southern Tagalog', 645.510000000001),
 (30, 'R', 'Shandong', 598.680000000001),
 (18, 'NC-17', 'West Bengali', 594.760000000001),
 (30, 'NC-17', 'Buenos Aires', 592.610000000001),
 (20, 'PG-13', 'Southern Tagalog', 590.940000000001),
 (30, 'R', 'Buenos Aires', 586.610000000001),
 (30, 'R', 'Southern Tagalog', 577.700000000001),
 (30, 'PG-13', 'California', 575.850000000001),
 (18, 'PG-13', 'West Bengali', 568.840000000001),
 (19, 'PG-13', 'Southern Tagalog', 566.720000000001),
 (30, 'R', 'Maharashtra', 563.730000000001),
 (18, 'G', 'West Bengali', 561.820000000001),
 (30, 'NC-17', 'Shandong', 560.820000000001),
 (30, 'PG-13', 'Liaoning', 555.020000000001),
 (30, 'PG-13', 'So Paulo', 554.820000000001),
 (21, 'PG', 'Uttar Pradesh', 550.940000000001),
 (30, 'PG-13', 'Guangdong', 537.870000000001),
 (30, 'PG-13', 'Buenos Aires', 536.700000000001)]